# VersionGUID Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaCommon..::..VersionGUID Property
SchemaCommon Class See Also
---
The property labeled "VersionGUID" common to all visual Asset types.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string VersionGUID { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VersionGUID As String
	Get
```

Visual C++
---
```text
public:
static property String^ VersionGUID {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyString" and will contain a uuid.
# See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace